run/tracked/Coarse/FrealKE_BCS_C/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


simulationType  RAS;

RAS
{
    model           realizableKE_BCS1;
    turbulence      on;
    printCoeffs     off;

    realizableKE_BCS1Coeffs

    {

        cCurv               1.0;
        cr1                 1.0;
        cr2                 2.0;
        cr3                 1.0;
        Cmu                0.09;
        C1                 1.44;

        C3                  0.0;
        A0                  4.0;
        C2                  1.9;
        sigmak              1.0;
        sigmaEps            1.2;

        curvatureCorrection true;
        swirlCorrection     false;
        buoyancyCorrection  false;

        axisOrigin          (0 0 0);
        axisDirection       (0 0 1);

        S0                  0.2;
        S1                  0.8;
        frMax               1.25;
        swirlEps            1e-6;
        Cg                  1.0;
        writeFields         false;
    }
}


// ************************************************************************* //
